IDEA Open Model
InputValue Enumeration
Compatible with IDEA StatiCa Beta 20.0
 Input value type
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public enum InputValue
Public Enumeration InputValue
Members
Member name | Value | Description
Calculated | 0 |  Value is calculated
UserInput | 1 |  Value is inputed by user
CalculatedFEM | 2 |  values are calculated in FEM
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace